{
  "name": "Mentions",
  "namespace": "ConnectApi",
  "accessModifier": "global",
  "definitionModifier": "",
  "withSharing": false,
  "inheritedSharing": false,
  "isEnum": false,
  "enumValues": [],
  "extendsType": "",
  "isInterface": false,
  "implements": [],
  "classes": {},
  "enums": {},
  "fields": [],
  "constructors": [],
  "methods": [
    {
      "name": "getMentionCompletions",
      "signature": "public static ConnectApi.MentionCompletionPage getMentionCompletions (String communityId, String q, String contextId)",
      "description": "Get the first page of possible users and groups to mention in a feed item body or comment body.",
      "params": [
        {
          "name": "contextId",
          "datatype": "String",
          "description": "Use either the ID for a community, internal, or null. A search term for matching user and group names. Searching for a group requires a minimum of 2 characters. Searching for a user doesn’t require a minimum number of characters. This parameter does not support wildcards. A feed item ID (for a mention in a comment) or a feed subject ID (for a mention in a feed item) that narrows search results, with more useful results listed first. Use a group ID for groups that allow customers to ensure mention completion results include customers."
        }
      ],
      "datatype": "ConnectApi.​MentionCompletion​Page"
    },
    {
      "name": "getMentionCompletions",
      "signature": "public static ConnectApi.Mentions getMentionCompletions (String communityId, String q, String contextId, ConnectApi.MentionCompletionType type, Integer pageParam, Integer pageSize)",
      "description": "Get a page of possible mention proposals of the specified type.",
      "params": [
        {
          "name": "pageSize",
          "datatype": "Integer",
          "description": "Use either the ID for a community, internal, or null. A search term for matching user and group names. Searching for a group requires a minimum of 2 characters. Searching for a user doesn’t require a minimum number of characters. This parameter does not support wildcards. A feed item ID (for a mention in a comment) or a feed subject ID (for a mention in a feed item) that narrows search results, with more useful results listed first. Use a group ID for groups that allow customers to ensure mention completion results include customers. Type of mention completion.  All—All mention completions, regardless of the type of record to which the mention refers.   Group—Mention completions for groups.   User—Mention completions for users.    Specifies the number of the page you want returned. Starts at 0. If you pass in null or 0, the first page is returned. Specifies the number of items per page. Valid values are from 1 through 100. If you pass in null, the default size is 25."
        }
      ],
      "datatype": "ConnectApi.​MentionCompletion​Page"
    },
    {
      "name": "getMentionValidations",
      "signature": "public static ConnectApi.Mentions getMentionValidations(String communityId, String parentId, List<String> recordIds, ConnectApi.FeedItemVisibilityType visibility)",
      "description": "Get information about whether the mentions are valid for the context user.",
      "params": [
        {
          "name": "visibility",
          "datatype": "ConnectApi.FeedItemVisibilityType",
          "description": "Use either the ID for a community, internal, or null. The feed item parent ID. A comma separated list of IDs to be mentioned. The maximum value is 25. Type of users who can see a feed item.  AllUsers—Visibility is not limited to internal users.   InternalUsers—Visibility is limited to internal users."
        }
      ],
      "datatype": "ConnectApi.​​Mention​Validations"
    },
    {
      "name": "setTestGetMentionCompletions",
      "signature": "public static Void setTestGetMentionCompletions (String communityId, String q, String contextId, ConnectApi.MentionCompletionPage result)",
      "description": "Register a ConnectApi.MentionCompletionPage object to be returned when getMentionCompletions(String, String, String) is called in a test context.",
      "params": [
        {
          "name": "result",
          "datatype": "ConnectApi.​MentionCompletion​Page",
          "description": "Use either the ID for a community, internal, or null. A search term for matching user and group names. Searching for a group requires a minimum of 2 characters. Searching for a user doesn’t require a minimum number of characters. This parameter does not support wildcards. A feed item ID (for a mention in a comment) or a feed subject ID (for a mention in a feed item) that narrows search results, with more useful results listed first. Use a group ID for groups that allow customers to ensure mention completion results include customers. A ConnectApi.MentionCompletionPage object containing test data."
        }
      ],
      "datatype": "Void"
    },
    {
      "name": "setTestGetMentionCompletions",
      "signature": "public static Void setTestGetMentionCompletions (String communityId, String q, String contextId, ConnectApi.MentionCompletionType type, Integer pageParam, Integer pageSize, ConnectApi.MentionCompletionPage result)",
      "description": "Register a ConnectApi.MentionCompletionPage object to be returned when getMentionCompletions(String, String, String, ConnectApi.MentionCompletionType, Integer, Integer) is called in a test context.",
      "params": [
        {
          "name": "result",
          "datatype": "ConnectApi.​MentionCompletion​Page",
          "description": "Use either the ID for a community, internal, or null. A search term for matching user and group names. Searching for a group requires a minimum of 2 characters. Searching for a user doesn’t require a minimum number of characters. This parameter does not support wildcards. A feed item ID (for a mention in a comment) or a feed subject ID (for a mention in a feed item) that narrows search results, with more useful results listed first. Use a group ID for groups that allow customers to ensure mention completion results include customers. Type of mention completion.  All—All mention completions, regardless of the type of record to which the mention refers.   Group—Mention completions for groups.   User—Mention completions for users.    Specifies the number of the page you want returned. Starts at 0. If you pass in null or 0, the first page is returned. Specifies the number of items per page. Valid values are from 1 through 100. If you pass in null, the default size is 25. A ConnectApi.MentionCompletionPage object containing test data."
        }
      ],
      "datatype": "Void"
    }
  ],
  "description": "Access information about mentions. A mention is an “@” character followed by a user or group name. When a user or group is mentioned, they receive a notification.",
  "docLink": "https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta/apexcode/apex_ConnectAPI_Mentions_static_methods.htm"
}