{
  "name": "ConfigurableSelfRegHandler",
  "namespace": "Auth",
  "accessModifier": "global",
  "definitionModifier": "",
  "withSharing": false,
  "inheritedSharing": false,
  "isEnum": false,
  "enumValues": [],
  "extendsType": "",
  "isInterface": true,
  "implements": [],
  "classes": {},
  "enums": {},
  "fields": [],
  "constructors": [],
  "methods": [
    {
      "name": "createUser",
      "signature": "public Id createUser(Id accountId, Id profileId, Map<Schema.SObjectField,String> registrationAttributes, String password)",
      "description": "Create a community member from the information that the visitor provided on your community’s self-registration page.",
      "params": [
        {
          "name": "password",
          "datatype": "String",
          "description": "Default account with which the new user is associated. This value comes from the Account field setting on Login and Registration (L&amp;R) page under Registration Page Configuration. Profile to assign the new user. This value comes from the Profile field setting on the L&amp;R page under Registration Page Configuration. A map of attributes that the registering user entered on the self-registration page. The fields that appear on the self-registration page come from the User Fields selected on the L&amp;R page when the registration type is Configurable Self-Reg Page. The password entered by the user if “Include Password” is selected on the L&amp;R page. (If a password isn’t entered, the handler must generate one because a password is required to create a user.)"
        }
      ],
      "datatype": "Id"
    }
  ],
  "description": "Gives you more control over how visitors self-register for your community by creating a class that implements Auth.ConfigurableSelfRegHandler. You choose the user information to collect, and how users identify themselves—with their email address, phone number, or another identifier. Once verified, you create a new external user and log the user in to your community.",
  "docLink": "https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta/apexcode/apex_interface_Auth_ConfigurableSelfRegHandler.htm"
}