{
  "name": "JWS",
  "namespace": "Auth",
  "accessModifier": "global",
  "definitionModifier": "",
  "withSharing": false,
  "inheritedSharing": false,
  "isEnum": false,
  "enumValues": [],
  "extendsType": "",
  "isInterface": false,
  "implements": [],
  "classes": {},
  "enums": {},
  "fields": [],
  "constructors": [
    {
      "name": "JWS",
      "signature": "public JWS(Auth.JWT jwt, String certDevName)",
      "description": "Creates an instance of the JWS class using the specified Auth.JWT payload and the certificate used for signing the JWT bearer token.",
      "params": [
        {
          "name": "certDevName",
          "datatype": "String",
          "description": "The Base64-encoded JSON Claims Set in the JWT bearer token generated by Auth.JWT. The Unique Name for a certificate stored in the Salesforce org’s Certificate and Key Management page to use for signing the JWT bearer token."
        }
      ],
      "datatype": "void"
    },
    {
      "name": "JWS",
      "signature": "public JWS(String payload, String certDevName)",
      "description": "Creates an instance of the JWS class using the specified payload and certificate used for signing the JWT bearer token.",
      "params": [
        {
          "name": "certDevName",
          "datatype": "String",
          "description": "The Base64-encoded JSON Claims Set in the JWT bearer token. The Unique Name for a certificate stored in the Salesforce org’s Certificate and Key Management page to use for signing the JWT bearer token."
        }
      ],
      "datatype": "void"
    }
  ],
  "methods": [
    {
      "name": "clone",
      "signature": "public Object clone()",
      "description": "Makes a duplicate copy of the JWS object.",
      "params": [],
      "datatype": "JWS"
    },
    {
      "name": "getCompactSerialization",
      "signature": "public String getCompactSerialization()",
      "description": "Returns the compact serialization representation of the JWS as a concatenated string, with the encoded JWS header, encoded JWS payload, and encoded JWS signature strings separated by period ('.') characters.",
      "params": [],
      "datatype": "String"
    }
  ],
  "description": "Contains methods that apply a digital signature to a JSON Web Token (JWT), using a JSON Web Signature (JWS) data structure. This class creates the signed JWT bearer token, which can be used to request an OAuth access token in the OAuth 2.0 JWT bearer token flow.",
  "docLink": "https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta/apexcode/apex_class_Auth_JWS.htm"
}