{
  "name": "SamlJitHandler",
  "namespace": "Auth",
  "accessModifier": "global",
  "definitionModifier": "",
  "withSharing": false,
  "inheritedSharing": false,
  "isEnum": false,
  "enumValues": [],
  "extendsType": "",
  "isInterface": true,
  "implements": [],
  "classes": {},
  "enums": {},
  "fields": [],
  "constructors": [],
  "methods": [
    {
      "name": "createUser",
      "signature": "public User createUser(Id samlSsoProviderId, Id communityId, Id portalId, String federationId, Map<String,String> attributes, String assertion)",
      "description": "Returns a User object using the specified Federation ID. The User object corresponds to the user information and may be a new user that hasn’t t been inserted in the database or may represent an existing user record in the database.",
      "params": [
        {
          "name": "assertion",
          "datatype": "String",
          "description": "The ID of the SamlSsoConfig standard object. The ID of the community. This parameter can be null if you’re not creating a community user. The ID of the portal. This parameter can be null if you’re not creating a portal user. The ID Salesforce expects to be used for this user. All of the attributes in the SAML assertion that were added to the default assertion; for example, custom attributes. Attributes are case-sensitive. The default SAML assertion, base-64 encoded."
        }
      ],
      "datatype": "User"
    },
    {
      "name": "updateUser",
      "signature": "public void updateUser(Id userId, Id samlSsoProviderId, Id communityId, Id portalId, String federationId, Map<String,String> attributes, String assertion)",
      "description": "Updates the specified user’s information. This method is called if the user has logged in before with SAML single sign-on and then logs in again, or if your application is using the Existing User Linking URL.",
      "params": [
        {
          "name": "assertion",
          "datatype": "String",
          "description": "The ID of the Salesforce user. The ID of the SamlSsoConfig object. The ID of the community. This can be null if you’re not updating a community user. The ID of the portal. This can be null if you’re not updating a portal user. The ID Salesforce expects to be used for this user. All of the attributes in the SAML assertion that were added to the default assertion; for example, custom attributes. Attributes are case-sensitive. The default SAML assertion, base-64 encoded."
        }
      ],
      "datatype": "void"
    }
  ],
  "description": "Use this interface to control and customize Just-in-Time user provisioning logic during SAML single sign-on.",
  "docLink": "https://developer.salesforce.com/docs/atlas.en-us.apexcode.meta/apexcode/apex_interface_Auth_SamlJitHandler.htm"
}