{
    "features_summary": "Resumen de Características",
    "code_completion": "Autocompletado de Código",
    "advance:gui": "Interfaz Gráfica de Usuario Avanzada",
    "apex_code_formatter": "Formatear Código Apex",
    "version_control_and_metadata":"Control de Versiones y Metadatos",
    "documentation":"Documentación",
    "settings": "Configuración",
    "commands":"Comandos",
    "add_javascript_aura_function":"Add Javascript Aura Function",
    "add_method_block_aura_documentation":"Add Method Block to Aura Documentation",
    "compress_xml_file":"Compress XML File",
    "compress_all_xml_files":"Compress ALL XML Files",
    "edit_apex_comment_template":"Edit Apex Comment Template",
    "edit_aura_documentation_template":"Edit Aura Documentation Template",
    "generate_aura_doc":"Generate Aura Documentation",
    "match_org_with_local":"Match Org With Local",
    "new_aura_file":"New Aura File",
    "refresh_metadata_index":"Refresh Metadata Index",
    "refresh_metadata_index_for_object":"Refresh Metadata Index for Object",
    "retrieve_full_permission_sets":"Retrieve Full Permission Set(s)",
    "retrieve_full_profiles":"Retrieve Full Profile(s)",
    "views":"Vistas",
    "file_structure_view":"Estructura de Archivos",
    "graphic_user_interface":"Interfaz Gráfica de Usuario",
    "open_permission_set_on_ui":"Abrir Interfaz de Permission Set",
    "open_profile_on_ui":"Abrir Interfaz de Perfiles",
    "package_generator_xml":"Generador de Paquetes (package.xml)",
    "code_completion_tools":"Herramientas de Autocompletado",
    "call_and_create_aura_components":"Obtener, llamar y crear Componentes",
    "get_aura_components_attributes":"Obtener Attributos de Componentes",
    "get_js_controller_functions":"Obtener Functiones del Controlador JS",
    "get_js_helper_functions":"Obtener Functiones del Helper JS",
    "get_apex_methods_on_js":"Obtener Métodos Apex en JS",
    "support_on_queries":"Soporte en Consultas",
    "apex_code_support":"Soporte para Código Apex",
    "custom_labels_support": "Seporte para Etiquetas Personalizadas",
    "picklist_values_support": "Soporte para Valores de Listas de Selección",
    "documentation_templates":"Documentación (Plantillas)",
    "aura_doc_template":"Plantilla de Documentacion Aura",
    "apex_comment_template":"Plantilla de Comentarios Apex",
    "snippets_collection":"Colección de Snippets",
    "help_introduction":"Aura Helper incluye una ayuda navegable para conocer más a fondo todas las funcionalidades que contiene la extensión y así hacer un mejor uso y ser más productivo",
    "examples":"Ejemplos",
    "example":"Ejemplo",
    "custom_labels_gui": "Interfaz de Etiquetas Personalizadas",
    "code_completion_feature_explanation_paragraph_1":"Aura Helper pone a disposición del usuario múltiples herramientas de autocompletado de código para facilitar la codificación, que pueden ser activadas o desactivadas desde la configuración de la extensión.",
    "code_completion_feature_explanation_paragraph_2":"Algunas de las funciones son:",
    "code_completion_feature_explanation_feature_1":"Capacidad para listar todos los objetos, custom y estándar disponibles en la aplicación. Funciona en las clases Apex",
    "code_completion_feature_explanation_feature_2":"Listar los campos de los objetos, incluyendo información como el label, los valores picklist, la longitud... Funciona tanto en clases Apex como en componentes Lightning",
    "code_completion_feature_explanation_feature_3":"Mostrar todas las clases de la aplicación, incluyendo las clases de sistema (System, Database...). Funtiona en las clases Apex",
    "code_completion_feature_explanation_feature_4":"Obtener y listar las variables y métodos de todas las clases, incluyendo las clases de sistema. Funtiona en las clases Apex",
    "code_completion_feature_explanation_feature_5":"Capacidad para crear comentarios de clases y métodos de forma rápida a través de una plantilla definida por el usuario",
    "code_completion_feature_explanation_feature_6":"Capacidad para listar la información anterior de forma concatenada (clase.metodo().metodo()...). Funciona tanto en clases Apex como en componentes Lightning",
    "code_completion_feature_explanation_feature_7":"Listar todos los componentes lightning custom y estándar de cualquier espacio de nombre (lightning, aura...)",
    "code_completion_feature_explanation_feature_8":"Listar los atributos no incluidos en las llamadas a los componentes lightnig, tanto custom como estándar de cualquier espacio de nombre",
    "code_completion_feature_explanation_feature_9":"Sugerir los posibles valores de los atributos de los elementos de los componentes lightning, como variants, sizes...",
    "code_completion_feature_explanation_feature_10":"Capacidad para mostrar las funciones de los controladores Apex, Javascript o el archivo Helper en los archivos de cualquier Bundle de Lightning",
    "code_completion_feature_explanation_feature_11":"Soporte para facilitar la construcción de consultas mostrando los campos del objeto indicado en la clausula \"from\"",
    "code_completion_feature_explanation_feature_12":"Más de 100 Snippets de código para facilitar la creación de componentes lightning. Para más detalle ver la sección de",
    "code_completion_feature_explanation_feature_13":"Soporte de Autocompletado para las Custom Labels. Es necesario tenerlas descargadas en el proyecto. Funciona en Apex, Lightning y Javascript",
    "code_completion_feature_explanation_feature_14":"Soporte para el autocompletado de los valores de las picklist. Aura Helper muestra todos los valores disponibles de los campos de un objeto y permite seleccionarlo para sustituir el valor (Ejemplo: Account.picklistfield.picklistValue -> 'picklistValue')",
    "code_completion_feature_explanation_feature_15": "Capacidad de implementar automáticamente los interfaces y clases extendidas. En este último caso sólo aplican los métodos virtuales y abstractos",
    "advance_gui_feature_explanation_paragraph_1":"Otra de las principales características que implementa Aura Helper, es el soporte de una interfaz gráfica avanzada para implementar características más potentes que faciliten el mantenimiento de metadatos o sirvan de soporte para otras tareas.",
    "advance_gui_feature_explanation_paragraph_2":"A través de la interfaz gráfica, Aura Helper provee de una herramienta para crear archivos <code>package.xml</code> de forma rápida, tanto de los metadatos que existen en local, como de todos los metadatos de la organización.",
    "advance_gui_feature_explanation_paragraph_3":"Otra característica implementada a través de la interfaz, es la capacidad para gestionar los ficheros de metadatos como si de Salesforce se tratase. Añade validaciones y comportamiento similares, teniendo en cuenta el contexto y las posibilidades que ofrece VSCode.",
    "advance_gui_feature_explanation_paragraph_4": "Por último, cabe destacar que Aura Helper dispone de soporte multilenguaje para la interfaz gráfica avanzada, pudiendo elegir entre los distintos idiomas disponibles desde la configuración de Aura Helper",
    "advance_gui_feature_explanation_paragraph_5": "Las Vistas disponibles actualmente son:",
    "advance_gui_feature_available_view_1": "Vista para ver y editar perfiles",
    "advance_gui_feature_available_view_2": "Vista para ver y editar sets de permisos",
    "advance_gui_feature_available_view_3": "Generador de Paquetes",
    "advance_gui_feature_available_view_4": "Vista para ver, crear y editar etiquetas personalizadas",
    "advance_gui_feature_available_view_5": "Ayuda",
    "apex_code_formatter_feature_explanation_paragraph_1":"Debido a la falta de formateadores de código exclusivamente para Apex y que las extensiones oficiales de salesforce tampoco lo implementan, Aura Helper dispone de una herramienta para formatear código Apex. Únicamente debemos pulsar <code>Alt + Shift + F</code>. El Formateador de Aura Helper permite al usuario configurar el estilo del formato desde la configuración de Aura Helper (Ver sección de Configuración)",
    "version_control_and_metadata_feature_explanation_paragraph_1":"Para facilitar el trabajo con aplicaciones de control de versiones como Git, Aura Helper contiene varias herramientas para gestionar los archivos de metadatos que simplifican el control de versiones en Salesforce.",
    "version_control_and_metadata_feature_explanation_paragraph_2":"Algunas de las herramientas son:",
    "version_control_and_metadata_feature_explanation_feature_1":"Posibilidad de comprimir los archivos XML de forma que ocupen menos líneas y reorganizar el contenido para facilitar su lectura por parte del usuario",
    "version_control_and_metadata_feature_explanation_feature_2":"Interfaz gráfica para gestionar los ficheros de forma más simple y sin salir de VSCode",
    "version_control_and_metadata_feature_explanation_feature_3":"Posibilidad de actualizar los ficheros que se crean en tiempo de ejecucion durante los despliegues en función del contenido, como por ejemplo los perfiles o permission sets, incluyendo toda la información del sistema y sin necesidad de actualizar los demás elementos",
    "version_control_and_metadata_feature_explanation_feature_4":"Capacidad para comprobar qué elementos existen en el entorno y no en local, para poder eliminarlos e igualar el entorno con el contenido local. El usuario puede elegir qué metadatos se borraran",
    "version_control_and_metadata_feature_explanation_feature_5":"Si deseamos realizar despliegues o descargas de metadatos, podemos usar la herramientas de Generador de Paquetes y las opciones de Deploy y Retrieve de SFDX. La herramienta de crear paquetes permite listar todos los metadatos almacenados (en local y en la organización) y seleccionarlos manualmente, desde otro archivo package.xml o desde git para un mejor control de versiones",
    "documentation_feature_explanation_paragraph_1":"Documentación",
    "documentation_feature_explanation_paragraph_2":"Las principales herramientas son:",
    "documentation_feature_explanation_feature_1":"Capacidad para generar comentarios de clases y métodos Apex siguiendo la estructura de una plantilla definida por el usuario, de forma que se pueda adaptar el estilo de los comentarios al establecido en el proyecto.",
    "documentation_feature_explanation_feature_2":"Soporte para generar de forma automática toda o casi toda la documentación de los componentes Lightning <code>(.auradoc)</code>. Usando el esquema de comentarios Javascript, y una plantilla definida por el usuario, se puede generar casi la totalidad de la documentación con un sólo click",
    "documentation_feature_explanation_feature_3": "Soporte para generar documentación del proyecto automáticamente similar a la documentación oficial de Salesforce con links a los tipos de datos (Estándard y Personalizados). Para hacer esto, utiliza las clases almacenadas localmente junto con los comentarios de métodos, clases y variables que coinciden con la plantilla establecida. Se agregó soporte para crear comentarios para las variables de clase para que puedan analizarse más tarde para generar documentación",
    "settings_feature_explanation_paragraph_1": "Aura Helper pone a disposición del usuario distintas opciones de configuración para adaptar la herramienta a su flujo de trabajo",
    "settings_feature_explanation_paragraph_2": "Algunas de las configuraciones son:",
    "settings_feature_explanation_feature_1": "Configurar el estilo para el formato de código apex",
    "settings_feature_explanation_feature_2": "Activar o Desactivar herramientas de autocompletado de código",
    "settings_feature_explanation_feature_3": "Elegir el idioma por defecto para la Interfaz Gráfica Avanzada",
    "add_javascript_aura_function_command_paragraph_1":"Este comando permite la creación de un bloque de código que representa una función Javascript en los archivos Aura que permite elegir el número de parámetros que tendrá la función, de esta forma podemos crear funciones más rápido.",
    "add_javascript_aura_function_command_paragraph_2":"Para utilizar esta característica se debe situar el ratón en la posicion del archivo donde queramos crear la función y ejecutar el comando \"Add Javascript Aura Function\", elegimos el número de parámetros que queremos para la función y listo.",
    "add_method_block_aura_documentation_command_paragraph_1":"Este comando permite añadir un nuevo método al fichero de documentación de Aura siguiendo el esquema establecido en la plantilla. El bloque se creará en la posición del ratón al ejecutar el comando y al ejecutarlo nos proveerá una lista de los métodos disponibles, tanto del helper como del controlador.",
    "add_method_block_aura_documentation_command_paragraph_2":"Puede editar la plantilla en cualquier momento con el comando <a href=\"#editAuraDocumentationTemplate\">\"Edit Aura Documentation Template\"</a>. Para saber más sobre las plantillas, <a href=\"#templatesSection\">pulse aquí</a>",
    "compress_xml_file_command_paragraph_1":"Para facilitar la gestión de fichero con programas de control de versiones como GIT, Aura Helper provee un método para comprimir los ficheros XML de los metadatos de forma que sea más fácil de identificar los cambios, combinarlos o desecharlos. También reduce el tamaño de los ficheros permitiendo una gestión más eficiente por parte de Git o similares.",
    "compress_xml_file_command_paragraph_2":"Para ejecutar este comando tenemos varias opciones:",
    "compress_xml_file_command_option_1":"Ejecutar el comando con un fichero XML abierto para comprimir dicho archivo",
    "compress_xml_file_command_option_2":"Hacer click con el botón derecho en el fichero abierto y ejecutar el comando desde el menú contextual",
    "compress_xml_file_command_option_3":"Hacer click derecho en el fichero en el explorador de archivos y ejecutar el comando desde el menú contextual",
    "compress_all_xml_files_command_paragraph_1":"Al igual que podemos comprimir un sólo fichero, podemos comprimir todos los ficheros de metadatos del proyecto o de una carpeta concreta.",
    "compress_all_xml_files_command_paragraph_2":"Para ejecutar este comando tenemos varias opciones:",
    "compress_all_xml_files_command_option_1":"Si ejecutamos el comando desde la paleta de comandos, se comprimiran todos los ficheros",
    "compress_all_xml_files_command_option_2":"Hacer click derecho en la carpeta raíz de los metadatos del proyecto y ejecutar el comando desde el menú contextual. Esto comprimirá todos los ficheros",
    "compress_all_xml_files_command_option_3":"Hacer click derecho en una carpeta concreta y ejecutar el comando desde el menú contextual. Esto comprimirá todos los ficheros de esa carpeta, incluyendo las subcarpetas",
    "edit_apex_comment_template_command_paragraph_1":"El comando \"Edit Apex Comment Template\" permite editar la plantilla que se usará para crear los comentarios de las clases y métodos Apex. Esta plantilla puede ser editada por el usuario siguiendo las reglas indicadas en las seccion de plantillas para así adaptar la documentación del proyecto a los estándares establecidos por el usuario",
    "templates_more_info":"To learn more about templates, <a href=\"#templatesSection\">click here</a>",
    "edit_aura_documentation_template_command_paragraph_1":"Este comando, similar al comando para editar la plantilla de comentario de Apex, permite crear y editar una plantilla para crear la documentación de los componentes Lightning de forma automática.",
    "generate_aura_doc_command_paragraph_1":"Este comando permite crear la documentación Aura de los componentes lightning de forma automática basada en la plantilla definida por el usuario y el esquema básico de comentarios de Javascript",
    "generate_aura_doc_command_paragraph_2":"Puede editar la plantilla de la documentación cuando desee ejecutando el comando <a href=\"#editAuraDocumentationTemplate\">\"Edit Aura Documentation Template\"</a>",
    "match_org_with_local_command_paragraph_1":"El comando \"Match Org With Local\" compara todos los metadatos que existen en el proyecto local con los metadatos que existen en la aplicación para, posteriormente, ofrecer al usuario una vista con los metadatos que existen en la organización pero que no existen en local. El proceso puede tardar varios minutos dependiendo de la conexión a Internet y las prestaciones del equipo.",
    "match_org_with_local_command_paragraph_2":"En la vista mostrada, el usuario puede elegir qué metadatos quiere borrar de la organización para igualar el entorno con el proyecto local y, al hacer click en \"Eliminar\", se eliminarán de la organización los metadatos seleccionados. Este proceso es bastante más rápido que la comparación de datos, a excepción de producción, donde se ejecutarán las clases de test, lo que puede alargar el proceso.",
    "new_aura_file_command_paragraph_1":"Con este comando podemos crear cualquier fichero dentro del paquete Aura. Podemos ejecutarlo de dos formas:",
    "new_aura_file_command_paragraph_2":"Tras la ejecución de este comando se nos mostrará una lista para elegir el tipo de fichero que deseamos crear. Sólo apareceran los ficheros que no existan en el Bundle.",
    "new_aura_file_command_paragraph_3":"Todos los ficheros se crearán con la estructura por defecto, excepto el fichero de documentación, que se creará con la plantilla definida por el usuario (o la plantilla por defecto)",
    "new_aura_file_command_option_1":"Se puede ejecutar este comando cuando un archivo de Componente Aura (<code>.cmp</code>) está abierto en el editor",
    "new_aura_file_command_option_2":"Se puede hacer click derecho en el archivo de Componente Aura (<code>.cmp</code>) o en la carpeta del paquete del componente y seleccionar el comando en el menú contextual",
    "refresh_metadata_index_command_paragraph_1":"Para ofrecer una mejor experiencia de autocompletado de código, Aura Helper tiene comandos para refrescar el índice de objetos y sus campos. Para actualizar este índice, debemos ejecutar este comando",
    "refresh_metadata_index_command_paragraph_2":"Esta operación puede tardar varios minutos dependiendo del número de objetos de la organización, pero sólo es necesario ejecutarlo por completo una vez, ya que Aura Helper dispone de otro comando para actualizar el <a href=\"#refreshMetadataIndexForObject\">Indice de un Objeto</a>, siendo una ejecución mucho más rápida.",
    "refresh_metadata_index_for_object_command_paragraph_1":"Al igual que podemos actualizar el índice para todos los objetos de la organización, podemos hacerlo para un sólo objeto. Esta operación es significativamente más rápida que la actualización completa del índice.",
    "refresh_metadata_index_for_object_command_paragraph_2":"Esta operación puede tardar varios minutos, dependiendo de la velocidad de conexión y el número de objetos de la organización.",
    "refresh_metadata_index_for_object_command_paragraph_3":"Para actualizar el índice completo ejecute el comando <a href=\"#refreshMetadataIndex\">\"Refresh Metadata Index\"",
    "retrieve_full_permission_sets_command_paragraph_1":"Este comando permite actualizar los archivos de permissions sets almacenados en local con la totalidad de los permisos, al contrario que un retrieve normal, que se trae información básica si incluimos otros metadatos como classes, campos, objetos...",
    "retrieve_full_permission_sets_command_paragraph_2":"Sólo afecta a los ficheros de permisos y permite la actualización de uno o todos los permisos, tanto los almacenados en local como todos los de la organización.",
    "retrieve_full_profiles_command_paragraph_1":"Este comando permite actualizar los archivos de perfiles almacenados en local con la totalidad de los permisos, al contrario que un retrieve normal, que se trae información básica si incluimos otros metadatos como classes, campos, objetos...",
    "retrieve_full_profiles_command_paragraph_2":"Sólo afecta a los ficheros de perfiles y permite la actualización de uno o todos los perfiles, tanto los almacenados en local como todos los de la organización.",
    "file_structure_view_tool_paragraph_1":"Aura Helper provee de una vista que permite identificar rápidamente la estructura de métodos, campos, clases, etiquetas o elementos de diversos ficheros tanto classes Apex, archivos JavaScript de componentes Aura o los mismos componentes. También permite ver la estructura de varios ficheros XML de Metadatos.<br />Al pulsar en cualquiera de los elementos de la lista, se navegará directamente a la definición del elemento pulsado.",
    "file_structure_view_tool_paragraph_2":"Esta vista se puede activar y desactivar este panel de la vista lateral desde las opciones de la extensión.",
    "open_permission_set_on_ui_tool_paragraph_1":"Aura Helper incluye herramientas para proveer al usuario de una interfaz gráfica para facilitar la gestión de los Permission Sets. La interfaz se gestiona de forma similar a salesforce, con similares respuestas.",
    "open_profile_on_ui_tool_paragraph_1":"Igual que se pueden abrir los permission sets en la interfaz gráfica, se pueden gestionar los permiles del mismo modo para gestionar todos los permisos sin salir de VSCode de forma sencilla.",
    "package_generator_xml_tool_paragraph_1":"Aura Helper incluye una herramienta que permite la generación de archivos <code>package.xml</code> tanto para descargar como para desplegar metadatos.",
    "package_generator_xml_tool_paragraph_2":"Es capaz de cargar y mostrar todos los tipos de metadatos almacenados en el proyecto local, así como mostrar todos los metadatos de la organización. También permite guardar el fichero en el manifest del proyecto, o en cualquier otra ubicación",
    "custom_labels_gui_tool_paragraph_1": "Otra de las interfaces gráficas de las que dispone Aura Helper es la de gestión de Etiquetas Personalizadas. Una Vista para poder crear, editar, eliminar o buscar entre las etiquetas personalizadas del proyecto.",
    "custom_labels_gui_tool_paragraph_2": "Junto con la herramienta de autocompletado de código para etiquetas personalizadas, proporciona una gran herramienta para usar y gestionar estas etiquetas de forma mucho más eficiente. Será necesario descargarlas en el proyecto local para hacer uso de estas herramientas",
    "code_completion_tools_explanation":"Aura Helper provee múltiples herramientas de autocompletado de código tanto para Apex como para Lightning, permitiendo una programación más fácil y eficiente.<br />Al mismo tiempo dispone de múltiples snippets que pueden verse más detenidamente en la sección de <a href=\"#snippetsCollectionSection\">Snippets</a>",
    "call_and_create_aura_components_tool_paragraph_1":"Una de las herramientas de autocompletado de código de las que dispone Aura Helper es la posibilidad de obtener, llamar y contruir componetnes, eventos y aplicaciones Lightning",
    "call_and_create_aura_components_tool_paragraph_2":"Formas de uso:",
    "call_and_create_aura_components_tool_paragraph_3":"Funciona tanto en archivos <code>.cmp</code> como <code>.js</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "call_and_create_aura_components_tool_option_1":"Escribir <code>c:</code> y presionar <code>Ctrl+space</code> para obtener una lista de todos los componentes, eventos y aplicaciones del espacio de nombre \"c\"",
    "call_and_create_aura_components_tool_option_2":"Si se escribe <code>&lt;c:ComponentName </code> y se presiona <code>Ctrl+space</code> se obtendrá una lista de todos los atributos del componente, apareciendo únicamente los que no están ya añadidos al componente",
    "call_and_create_aura_components_tool_option_3":"Una vez escrito el atributo, Aura Helper puede sugerirnos los posibles valores admitidos presionando <code>Ctrl+space</code>",
    "call_and_create_aura_components_tool_option_4":"Para llamar componentes Standard (aura, lightning, ui...), únicamente debemos escribir <code>&lt;Namespace:ComponentName </code> y presionar <code>Ctrl+space</code> para obtener una lista de los atributos del componente",
    "call_and_create_aura_components_tool_option_5":"También se disponen de múltiples snippets para crear todo tipo de componentes y sus cariantes, revisar la seccion de <a href=\"#snippetsCollectionSection\">Snippets</a>",
    "get_aura_components_attributes_tool_paragraph_1":"Del mismo modo que se pueden obtener los atributos de los componentes para crearlos de forma rápida, se pueden obtener estos para referenciarlos en el componente. Para hacer esto, úncamente se debe escribir <code>v.</code> y presionar <code>Ctrl+space</code> para obtener todos los atributos. También se obtendrán los atributos heredaros.",
    "get_aura_components_attributes_tool_paragraph_2":"Si el atributo es algún SObject, se podrá obtener una lista de sus campos, incluso concatenarlos con otros campos en caso de relaciones. <code>v.sObjectType.field.field.field...</code>. Para sacar todo el potencial de esta función, es necesario actualizar el <a href=\"#refreshMetadataIndex\">Indice de Objetos</a>",
    "get_aura_components_attributes_tool_paragraph_3":"Funciona tanto en archivos <code>.cmp</code> como <code>.js</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "get_js_controller_functions_tool_paragraph_1":"Aura Helper también provee otras herramientas de autocompletado de código que permite obtener los métodos del controlador JavaScript desde los componentes",
    "get_js_controller_functions_tool_paragraph_2":"Para hacer uso de esta característica, úncamente se debe escribir <code>c.</code> y presionar <code>Ctrl+space</code> para obtener los nombres de las funciones. Esto también obtiene las funciones heredadas",
    "get_js_controller_functions_tool_paragraph_3":"Funciona tanto en archivos <code>.cmp</code> como <code>.js</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "get_js_helper_functions_tool_paragraph_1":"Al igual que con los métodos del controlador, Aura Helper puede obtener los métodos del helper para facilitar la codificación",
    "get_js_helper_functions_tool_paragraph_2":"Para hacer uso de esta característica, úncamente se debe escribir <code>helper.</code> y presionar <code>Ctrl+space</code> para obtener los nombres de las funciones. Esto también obtiene las funciones heredadas. Para facilitar el uso, se recomienda identificar el parámetro del helper con el nombre \"helper\"",
    "get_js_helper_functions_tool_paragraph_3":"Funciona en archivos <code>.js</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "get_apex_methods_on_js_tool_paragraph_1":"Del mismo modo que con los métodos del controlador o el helper, Aura Helper también dispone de herramientas para obtener los métodos del controlador Apex",
    "get_apex_methods_on_js_tool_paragraph_2":"Para ello, únicamente se debe escribir <code>c.</code> y presionar <code>Ctrl+space</code> para obtener el nombre de los métodos. Como en el resto de casos, también obtiene las funciones heredadas",
    "get_apex_methods_on_js_tool_paragraph_3":"Funciona en archivos <code>.js</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "support_on_queries_tool_paragraph_1":"Aura Helper contiene también herramientas para ayudar a completar las consultas permitiendo listar los campos del objeto a consultar",
    "support_on_queries_tool_paragraph_2":"Una vez escrita la estructura mímina de una consulta <code>Select Id from [SObject]</code>, podemos obtener los campos indicados en el objeto tras el from presionando <code>Ctrl+space</code> en la clausula de proyección. Esta característica funciona tanto para las queries tanto en componentes lightning, ficheros Javascript o clases Apex, tanto para queries entre [] como queries entre ''",
    "support_on_queries_tool_paragraph_3":"Para aprovechar al máximo esta característica, es necesario actualizar el <a href=\"#refreshMetadataIndex\">Indice de Objetos</a>",
    "support_on_queries_tool_paragraph_4":"Funciona tanto en archivos <code>.cmp</code> como <code>.js</code> y <code>.cls</code> y puede activarse y desactivarse desde la configuración de la extensión",
    "apex_code_support_tool_paragraph_1":"Por último, como no podía ser menos, Aura Helper también dispone de múltiples herramientas para autocompletar código Apex",
    "apex_code_support_tool_paragraph_2":"Desde listar todos los objetos disponibles, Estandar o Custom, como las clases creadas en la aplicación, sus campos, métodos, etc.<br />También tiene soporte para concatenar llamadas de distintos tipos de datos o métodos como <code>className.methodName().fieldName</code>. Todas las operaciones se hacen con la información disponible en el proyecto local. Si se quiere trabajar con los últimos cambios será necesario refrescar el proyecto.",
    "apex_code_support_tool_paragraph_3":"Otra característica disponible es la posibilidad de crear comentarios de clases y métodos basados en una plantilla escribiendo <code>/**</code>",
    "apex_code_support_tool_paragraph_4":"Para aprovechar al máximo esta característica, es necesario actualizar el <a href=\"#refreshMetadataIndex\">Indice de Objetos</a>",
    "apex_code_support_tool_paragraph_5":"Funciona en archivos <code>.cls</code>, puede activarse y desactivarse desde la configuración de la extensión y tiene soporte para clases y objetos custom y estándar",
    "documentation_templates_tools_explanation":"Aura Helper dispone de herramientas para crear diferentes elementos basados en plantillas definidas por el usuario. Todas las plantillas usadas por Aura Helper están formato JSON<br />A continuación se muestra la estructura de cada plantilla",
    "templates_keywords_no_effect":"The rest of <b>Keywords</b> will have no effect on this section of the template",
    "aura_doc_template_tool_paragraph_1":"Para facilitar la creación de la documentación de componentes Aura, se puede definir una plantilla de forma que se genere la mayoría del código de la documentación de forma automática. Lo que permite crear la documentación de forma más rápida y sencilla.",
    "aura_doc_template_tool_paragraph_2":"La plantilla para crear la Documetnación de Aura de forma automática tiene la siguiente estructura:",
    "aura_doc_template_tool_paragraph_3":"Se pueden usar distintas <b>Palabras Clave</b> para completar la plantilla de documentación.",
    "aura_doc_template_tool_paragraph_4":"Lineas principales del cuerpo. Es el esqueleto básico para el fichero de Documentación de Aura. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "aura_doc_template_tool_paragraph_5":"Estas lineas representan la estructura de cada método en la documentación. Cuando Aura Helper genera el fichero de documentación, copia la información de cada método con la estructura definida en esta plantilla y, después, reemplaza las <b>Palabras Clave</b> {!controllerMethods} o {!helperMethods} con el contenido generado. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "aura_doc_template_tool_paragraph_6":"Estas líneas, por último, representan la estructura de cada parámetro de los métodos. Como en la sección \"methodBody\", Aura Helper copia la información de cada parámetro siguiendo esta plantilla, y reemplaza la <b>Palabra Clave</b> {!method.params} con el contenido generado. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "apex_comment_template_tool_paragraph_1":"Para facilitar la documentación de las clases Apex, Aura Helper también dispone de una plantilla que se puede definir por el usuario para establecer un esquema de comentarios, tanto para los comentarios de clases como de los métodos.",
    "apex_comment_template_tool_paragraph_2":"La plantilla para crear Comentarios Apex de forma automática tiene la siguiente estructura:",
    "apex_comment_template_tool_paragraph_3":"Se pueden usar distintas <b>Palabras Clave</b> para completar la plantilla de documentación.",
    "apex_comment_template_tool_paragraph_4":"Sección para crear la estructura de los comentarios de los métodos Apex:",
    "apex_comment_template_tool_paragraph_5":"Líneas principales del comentario. Representa el esqueleto básico de los comentarios Apex para los métodos. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "apex_comment_template_tool_paragraph_6":"Estas líneas representan el esquema básico para cada parámetro de los métodos en el comentario. Al generar el comentario, Aura Helper copia la información de cada parámetro de los métodos siguiendo la estructura definida y y sustituye la <b>Palabra Clave</b> {!method.params} con el contenido generado. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "apex_comment_template_tool_paragraph_7":"Las líneas definidas en esta sección representan la estructura básica de la información devuelta por el método. Como con los parámetros, Aura Helper copia la información correspondiente usando la estructura indicada y reemplaza la <b>Palabra Clave</b> {!method.return} por el contenido generado. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "apex_comment_template_tool_paragraph_8":"Sección para crear la estructura de los comentarios de las clases Apex:",
    "apex_comment_template_tool_paragraph_9":"Líneas principales del comentario. Representa el esqueleto básico de los comentarios Apex para los métodos. En esta sección se pueden usar las siguientes <b>Palabras Clave:</b>",
    "custom_labels_support_tool_paragraph_1": "Otra útil herramienta de autocompletado de código es el soporte para etiquetas personalizadas. Para poder hacer uso de esta característica es necesario tener las etiquetas descargadas en el proyecto local.",
    "custom_labels_support_tool_paragraph_2": "Funciona tanto en Apex, Componentes Aura y ficheros Javascript. Para usar esta característica, únicamente debemos escribir <code>Label.</code> y presionar <code>ctrl + space</code> para obtener una lista con todas las etiquetas y poder seleccionar la que deseemos. Aura Helper sustituira el valor correcto dependiendo del tipo de archivo.",
    "main_data":"Información Principal",
    "show": "Mostrar",
    "application_visibilities": "Visibilidad de Aplicaciones",
    "category_group_visibilities": "Visibilidad de Categoría de Grupos",
    "class_accesses": "Acceso a Clases",
    "custom_metadata_type_accesses": "Acceso a los Tipos de Metadatos Personalizados",
    "custom_permissions": "Permisos Personalizados",
    "custom_setting_accesses": "Acceso a Configuraciones Personalizadas",
    "external_data_source_accesses": "Acceso a Origenes Externos de Datos",
    "field_permissions": "Permisos de Campos",
    "field_level_securities": "Seguridad a Nivel de Campos",
    "flow_accesses": "Acceso a Flujos",
    "layout_assignments": "Assignación de Vistas",
    "login_hours": "Horas de Inicio de Sesión",
    "login_ip_ranges": "Rangos de IPs",
    "object_permissions": "Permisos de Objetos",
    "page_accesses": "Acceso a Páginas",
    "profile_action_overrides": "Acciones del Perfil Sobreescritas",
    "record_type_visibilities": "Visibilidad de los Tipos de Registro",
    "tab_visibilities": "Visibilidad de Pestañas",
    "user_permissions": "Permisos de Usuario",
    "show_fields": "Mostrar Campos",
    "show_layouts": "Mostrar Layouts",
    "add_ip_range": "Añadir Rango de IPs",
    "show_record_types": "Mostrar Tipos de Registro",
    "app_name": "Nombre de App",
    "visible": "Visible",
    "default": "Por Defecto",
    "class_name": "Nombre de la Clase",
    "enabled": "Activa",
    "custom_metadata_name": "Nombre del Metadato Personalizado",
    "permission_name": "Nombre del Permiso",
    "custom_setting_object_name": "Nombre del Objeto de Configuración Personalizada",
    "field_name": "Nombre del Campo",
    "readable": "Permiso de Lectura",
    "editable": "Permiso de Edición",
    "flow_name": "Nombre del Flujo",
    "layout_name": "Nombre de Vista",
    "assigned_record_type": "Tipo de Registro Asignado",
    "start_address": "Dirección Inicial",
    "end_address": "Dirección Final",
    "description": "Descripción",
    "actions": "Acciones",
    "object_name": "Nombre del Objeto",
    "allow_read": "Permitir Lectura",
    "allow_create": "Permitir Creación",
    "allow_edit": "Permitir Edición",
    "allow_delete": "Permitir Borrado",
    "view_all_records": "Ver Todos los Registros",
    "modify_all_records": "Modificar Todos los Registros",
    "page_name": "Nombre de la Página",
    "record_Type_name": "Nombre del Tipo de Registro",
    "tab_name": "Nombre de Pestaña",
    "visibility": "Visibilidad",
    "user_permission_name": "Nombre del Permiso de Usuario",
    "user_license": "Licencia de Usuario",
    "custom": "Personalizado",
    "permission_set": "Set de Permisos",
    "profile": "Perfil",
    "save": "Guardar",
    "compress_and_save": "Comprimir y Guardar",
    "cancel": "Cancelar",
    "all": "Todos",
    "form_package": "Desde un Package",
    "metadata_types": "Tipos de Metadatos",
    "filter_by_name": "Filtrar por Nombre",
    "objects": "Objetos",
    "items": "Elementos",
    "load_metadata_from_filesystem": "Cargar Metadatos del Proyecto Local",
    "load_metadata_from_auth_org": "Cargar Metadatos de la Organización",
    "overwrite_project_package": "Sobreescribir Package del Proyecto",
    "choose_directory_to_save": "Elegir un Directorio para Guardar",
    "create_for_retrieve": "Nombres  Explícitos",
    "create_for_deploy":"Usar Asterísco (*)",
    "delete": "Eliminar",
    "collapse": "Colapsar",
    "hide_fields": "Ocultar Campos",
    "hide_record_types":"Ocultar Tipos de Registro",
    "hide_layouts": "Ocultar Vistas",
    "filters": "Filtros",
    "filter": "Filtrar",
    "custom_labels": "Etiquetas Personalizadas",
    "category": "Categoría",
    "package_generator": "Generador de Paquetes",
    "help_title": "Ayuda de Aura Helper",
    "all_categories": "Todas las Categorías",
    "value": "Valor",
    "language": "Idioma",
    "name": "Nombre",
    "no_category": "Ninguna",
    "new_language": "Nuevo Idioma",
    "new_category": "Nueva Categoría",
    "new_custom_label": "Nueva Etiqueta",
    "edit": "Editar",
    "name_required": "El Nombre es Obligatorio",
    "value_required": "El Valor es Obligatorio",
    "laguage_required": "El Idioma es Obligatorio",
    "description_required": "La Descripción es Obligatoria",
    "create_custom_label_error": "No se puede crear la Etiqueta:",
    "edit_custom_label_error": "No se puede editar la Etiqueta:",
    "duplicate_label_error": "No se pueden crear dos Etiquetas con el mismo Nombre",
    "important": "¡Importante!",
    "custom_label_introduction": "Cuando se elimina una etiqueta, se elimina tanto del fichero local como de la organización. Por el contrario, cuando se crea o edita una etiqueta, sólo se incluye en el fichero, siendo necesario desplegar las etiquetas locales para subir las etiquetas creadas o editadas",
    "object_manager": "Gestor de Objetos",
    "object_manager_introduction": "El gestor de objetos toma como base los ficheros XML de los objetos para trabajar. Si no existe el fichero XML del objeto, aunque existan otros componentes como campos, validaciones... no se mostrarán en esta vista",
    "from_git": "Desde Git",
    "select_from_git_diff": "Seleccionar las diferencias:",
    "from_last_two_commits": "Desde los Dos Últimos Commits",
    "from_specific_commits": "Desde Dos Commits Específicos",
    "from_other_brach": "Desde Otra Rama",
    "from_two_branches": "Desde Dos Ramas Específicas",
    "select": "Seleccionar",
    "create_destructive_package": "Paquete Destructivo",
    "first_commit": "Primer Commit",
    "second_commit": "Segundo Commit",
    "branch": "Rama",
    "first_branch": "Primera Rama",
    "second_branch": "Segunda Rama",
    "select_for_deploy": "Seleccionar Para Desplegar",
    "select_for_delete": "Seleccionar Para Eliminar",
    "create_full_package": "Crear Paquete Completo",
    "create_package": "Crear Paquete",
    "close": "Cerrar",
    "select_from_git": "Seleccionar Desde GIT",
    "package_generator_introduction_1": "El Generador de Paquetes es una herramientas que aumenta las posibilidades de la gestión de los metadatos del proyecto con opciones muy potentes. Se pueden listar todos los metadatos almacenados en el proyecto local, o todos los metadatos de la organización autorizada para crear un paquete simple, completo o destructivo",
    "package_generator_introduction_2": "Por supuesto, permite seleccionar manualmente los metadatos y filtrarlos para una mejor búsqueda, pero lo que lo hace especialmente potente es la capacidad de seleccionar los metadatos basandose en un archivo <code>package.xml</code> o, mejor aún, desde las diferencias entre dos ramas, etiquetas, commits... de git, permitiendo un control de versiones mucho más detallado",
    "package_generator_introduction_3": "Las opciones para crear el archivo <code>package.xml</code> son:",
    "package_generator_introduction_4": "Crear para Descargar o para Desplegar. En el primer caso se incluyen de forma explícita todos los metadatos en el package. En el segundo caso usa el símbolo * siempre que sea posible. Esto sólo aplica para la creación simple de paquetes",
    "package_generator_introduction_5": "Seleccionar para desplegar o para eliminar.",
    "package_generator_introduction_6": "Sobreescribir el Package del proyecto o elegir una carpeta concreta. Esto sólo aplica a la creación de paquetes simples.",
    "package_generator_introduction_7": "El botón Crear Paquete genera un sólo fichero <code>package.xml</code>. Crear Paquete Completo genera tanto un archivo <code>package.xml</code> como <code>destructiveChanges.xml</code>. El útimo botón genera únicamente el fichero <code>destructiveChanges.xml</code>",
    "first_commit_missing":"Seleccione el Primer commit",
    "second_commit_missing":"Seleccione el Segundo commit",
    "branch_missing": "Selecciona una Rama",
    "first_branch_missing": "Selecciona la Primera Rama",
    "second_branch_missing": "Selecciona la Segunda Rama",
    "wrong_commits_order": "El Primer Commit debe tener una fecha inferior al Segundo Commit",
    "same_commits_error": "El Primer y el Segundo commit no pueden ser el mismo Commit",
    "same_branches_error": "La Primera y la Segnuda Rama no pueden ser la misma Rama",
    "less_than_two_commits_error": "No se pueden seleccionar metadatos desde los dos últimos commits por haber menos de dos commits en el repositorio",
    "git_fetch": "Actualizar",
    "not_metadata_selected_for_package_error": "No se han seleccionado metadatos para crear el paquete. Seleccione al menos un elemento para crear el archivo.",
    "not_metadata_selected_for_destructive_package_error": "No se han seleccionado metadatos para crear el paquete destructivo. Seleccione al menos un elemento para crear el archivo.",
    "not_metadata_selected_for_full_package_error": "No se han seleccionado metadatos para crear el paquete completo. Seleccione al menos un elemento para desplegar o eliminar",
    "package_created_ok": "El Paquete se ha creado correctamente",
    "destructive_package_ok": "El Paquete Destructivo se ha creado correctamente",
    "full_package_ok": "El Paquete Completo se ha creado correctamente",
    "select_from_package_error": "Archivo seleccionado incorrecto. Por favor, seleccione un archivo package.xml correcto.",
    "creating_package_error": "Ha ocurrido un error creando el paquete:",
    "not_metadata_selected_for_delete":"No se han seleccionado metadatos para eliminar. Seleccione al menos un elemento para ejecutar la operación.",
    "metadata_deleted_succesfully": "Metadatos Eliminados Correctamente",
    "delete_metadata_error": "Ha ocurrido un error eliminando los Metadatos:",
    "label_deleted_ok": "La Etiqueta {0} se ha Eliminado Correctamente",
    "label_delete_error": "Ha ocurrido un error eliminando la etiqueta",
    "label_created_succesfully": "La Etiqueta {0} se ha Creado Correctamente",
    "label_edited_succesfully": "La Etiqueta {0} se ha Editado Correctamente",
    "label_name_missing_error": "El Nombre de la Etiqueta es Obligatorio",
    "label_description_missing_error": "La Descripción de la Etiqueta es Obligatoria",
    "label_value_missing_error": "El Valor de la Etiqueta es Obligatorio",
    "user_canceled_operation": "La operación ha sido cancelada por el usuario",
    "accept": "Aceptar",
    "delete_confirmation_label_title": "Eliminar Custom Label",
    "delete_confirmation_label_message": "Se va a eliminar la Custom Label del fichero local y de la organización. ¿Está Seguro?",
    "download_metadata_options": "Download Metadata Options",
    "select_metadata_for": "Seleccionar Metadatos Para",
    "create_package_options": "Opciones de Paquete",
    "save_package_options": "Guardar Paquete en",
    "download_owned_metadata": "Objetos propios",
    "download_all_metadata": "Descargar Todo",
    "match_org_introduction": "A continuación, se muestran todos los elementos que existen en tu organización pero que no existen en el proyecto local. Únicamente se ha hecho la comprobación teniendo en cuenta los tipos de metadatos que se tienen en el proyecto local",
    "day": "Día",
    "start_time": "Hora de Inicio",
    "end_time": "Hora de Fin",
    "label": "Etiqueta",
    "has_activation_required": "Requiere Activactión",
    "apex_formatter_settings": "Estilo de Formato Apex",
    "apex_formatter_settings_paragraph_1": "Todas las opciones de formato apex están agrupadas como Apex Format, teniendo a su vez distintos grupos para la configuración",
    "apex_formatter_settings_class_members": "Class Members: Sección para configurar la formato para los miembros de las clases e interfaces (separación entre métodos, campos...)",
    "apex_formatter_settings_comments": "Comment: Opciones para el formateo de los comentarios",
    "apex_formatter_settings_operators": "Operator: Esta sección contiene distintas opciones para elegir cómo formatear los operadores",
    "apex_formatter_settings_punctuation": "Punctuation: Sección dedicada al estilo de formato de los distintos símbolos de puntuación (llaves, comas...)",
    "apex_formatter_settings_queries": "Query: Distintas opciones de configuración para el formateo de las consultas",
    "apex_formatter_settings_format_on_save": "Format on Save: Opción para elegir si se quiere formatear el código al guardar la clase o no",
    "metadata_settings": "Configuración de Metadatos",
    "metadata_settings_paragraph_1": "Sección para definir la versión API que usara Aura Helper para conectar con Salesforce entre otras opciones de gestión de metadatos. Se agrupan bajo el nombre de Metadata",
    "GUI_settings": "Interfaz Gráfica",
    "GUI_settings_paragraph_1": "Opciones de configuración para la interfaz gráfica de usuario. El grupo al que pertenecen es Graphic User Interface",
    "code_completion_settings": "Configuración de Autocompletado",
    "code_completion_settings_paragraph_1": "En esta sección se pueden activar o desactivar la mayoría de opciones de autocompletado de código que contiene Aura Helper. Estas opciones se encuentran agrupadas como Auto Completion Tools",
    "match_metadata_with_local": "Match Org Metadata with Local",
    "delete_order": "Order de Eliminación",
    "after": "Después",
    "before": "Antes"
}